tutorials/fsiFoam/beamInCrossFlow/elasticBeamInCrossFlow/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0	
    (0.45 0 0)
    (0.55 0 0)
    (0.55 0 -0.2)
    (0.45 0 -0.2)
//Level 1	
    (0.45 0.2 0)
    (0.55 0.2 0)
    (0.55 0.2 -0.2)
    (0.45 0.2 -0.2)
);

blocks
(
    hex (3 2 6 7 0 1 5 4) (4 8 8) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall interface
    (
        (3 0 4 7)
        (2 3 7 6)
        (1 2 6 5)
        (4 5 6 7)
    )
    symmetryPlane symmetry
    (
        (0 1 5 4)
    )
    wall bottom
    (
        (0 3 2 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
