tutorials/fsiFoam/beamInCrossFlow/elasticBeamInCrossFlow/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    linearGeometryTotalDisplacement;
//solidModel    unsLinearGeometry;
//solidModel    nonLinearGeometryTotalLagrangian;
solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryTotalLagrangian;

"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs"
{}

nonLinearGeometryTotalLagrangianCoeffs
{}

nonLinearGeometryUpdatedLagrangianCoeffs
{}

unsNonLinearGeometryTotalLagrangianCoeffs
{}

unsNonLinearGeometryUpdatedLagrangianCoeffs
{}

// ************************************************************************* //
